#include <iostream>

#pragma once

#define COLOR_CYAN "\033[1;36m"
#define COLOR_RESET "\033[0m"

const std::string TITLE = R"(  __  __       _     ____                     _ 
 |  \/  |     | |   |  _ \                   | |
 | \  / | __ _| |_  | |_) | __ _ ___  ___  __| |
 | |\/| |/ _` | __| |  _ < / _` / __|/ _ \/ _` |
 | |  | | (_| | |_  | |_) | (_| \__ \  __/ (_| |
 |_|  |_|\__,_|\__| |____/ \__,_|___/\___|\__,_|
                                                
  _____  _               _           _    _____                 _     
 |  __ \(_)             | |         | |  / ____|               | |    
 | |  | |_ _ __ ___  ___| |_ ___  __| | | |  __ _ __ __ _ _ __ | |__  
 | |  | | | '__/ _ \/ __| __/ _ \/ _` | | | |_ | '__/ _` | '_ \| '_ \
 | |__| | | | |  __/ (__| ||  __/ (_| | | |__| | | | (_| | |_) | | | |
 |_____/|_|_|  \___|\___|\__\___|\__,_|  \_____|_|  \__,_| .__/|_| |_|
                                                         | |          
                                                         |_|          

                                                         —— Mat Base Directed Graph Implementation
                                                            3124004333 24网络空间安全强国班 吴沛熹
)";

const std::string MENU = R"(
===================== Menu =====================
[1] 在邻接矩阵中新建节点
[2] 在邻接矩阵中插入边
[3] 在邻接矩阵中删除节点
[4] 在邻接矩阵中删除边
[5] 计算提供的节点的入度
[6] 计算提供的节点的出度
[7] 计算提供的节点的度
[8] 广度优先搜索 (BFS)
[9] 深度优先搜索 (DFS)
[10] 打印邻接矩阵
[11] 打印邻接表
[12] 查找从一个节点到另一个节点的路径是否存在
[13] 获取节点的第一个邻居
[14] 获取节点的下一个邻居
[0] 退出程序
================================================
)";